api/testing_client_app/test.yaml
config:
  target: "http:/192.168.10.211:5000"
  phases:
    - duration: 1
      arrivalRate: 1
      maxVusers: 100
      name: Client Spike
  environments:
    prod:
      target: "https://gwsp5-1.asi-asiapacific.com"
      phases:
        - duration: 1
          arrivalRate: 1
          maxVusers: 1
          name: Client Spike
  processor: "./script.js"

scenarios:
  - name: "Testing Client App"
    flow:
      - function: "logEnv"
      # login
      - post:
          url: "/login"
          json:
            username: "demo.01"
            password: "pass1234"
          capture:
            - json: "$.data.token"
              as: "token"